import axios from "axios";

export async function fetchNotes(params:type) {
    // має виконувати запит для отримання колекції нотаток із сервера. 
    // Повинна підтримувати пагінацію (через параметр сторінки) та фільтрацію за ключовим словом (пошук);
}
export async function createNote(params:type) {
    // має виконувати запит для створення нової нотатки на сервері. 
    // Приймає вміст нової нотатки та повертає створену нотатку у відповіді;
}
export async function deleteNote(params:type) {
    // має виконувати запит для видалення нотатки за заданим ідентифікатором. 
    // Приймає ID нотатки та повертає інформацію про видалену нотатку у відповіді.
}